app/Controllers/Admin.php

    public function pemain()
    {
        $model = new PemainModel();
        $data['pemain'] = $model->findAll();
---
SELECT *
FROM `pemain`

    public function team()
    {
        $model = new TeamModel();
        $data['team'] = $model->findAll();
---
SELECT *
FROM `team`

    public function storePemain()
    {
        $model = new PemainModel();
        $data = [
            'nama' => $this->request->getPost('nama'),
            'posisi' => $this->request->getPost('posisi'),
            'team' => $this->request->getPost('team')
        ];
        $model->insert($data);
---
INSERT INTO `pemain` (`nama`, `posisi`, `team`) VALUES ('Hendri Kurniawan', 'flank', 'Real Madrid')

    public function editPemain($id)
    {
        $model = new PemainModel();
        $data['pemain'] = $model->find($id);
---
SELECT *
FROM `pemain`
WHERE `pemain`.`id` = '7'

    public function deletePemain($id)
    {
        $model = new PemainModel();
        $model->delete($id);
---
DELETE FROM `pemain`
WHERE `id` IN ('7')

    public function storeTeam()
    {
        $model = new TeamModel();
        $data = [
            'nama' => $this->request->getPost('nama'),
            'slogan' => $this->request->getPost('slogan'),
            'asal' => $this->request->getPost('asal')
        ];
        $model->insert($data);
---
INSERT INTO `team` (`nama`, `slogan`, `asal`) VALUES ('Persipa Pati', 'persija jaya', 'Inggris')

    public function editTeam($id)
    {
        $model = new TeamModel();
        $data['team'] = $model->find($id);
---
SELECT *
FROM `team`
WHERE `team`.`id` = '1'

    public function deleteTeam($id)
    {
        $model = new TeamModel();
        $model->delete($id);
---
DELETE FROM `team`
WHERE `id` IN ('1')